import os

# Конфігурація бота Sosal метр
BOT_TOKEN = os.getenv('BOT_TOKEN', '8420258109:AAGw2KLSOVtL4G9WVhDAg9jqdAniAJgfCIE')

# Налаштування гри
BOT_NAME = "Sosal метр"
BOT_DESCRIPTION = "🔮 Магічний бот, який відповідає на питання 'Sosal ?'\n\nПросто натисніть кнопку і отримайте відповідь!"
BOT_USERNAME = "sosal_meter_bot"  # Змініть на ваш username

# Рандомні відповіді
YES_ANSWERS = [
    "✅ Ти прям заглатував",
    "🎯 Прям як Андрюша",
    "👍 Чемпіон наху",
    "✨ За тобою отчим плаче",
    "🌟 Король сасунов",
    "💫 Ну прям тігр",
    "🎉 Глок глок глок",
    "🔥 Даже женщіна так не сосе",
    "⭐ О да, сасун",
    "💎 Канєшно ти сосав"
]

NO_ANSWERS = [
    "❌ Повезло",
    "🚫 Значить любиш коли в очко довблять",
    "👎 Натурал",
    "💔 Не сасав",
    "😔 Нажаль не гей",
    "🤔 В тебе щіт",
    "😞 Сьодні без біленької",
    "😕 Чисте лічіко",
    "😟 Сасали у тебе",
    "😢 Спиш з закритим ротом"
]

# Емодзі для анімації
THINKING_EMOJIS = ["🤔", "💭", "✨", "🌟", "💫", "🎯", "🔍", "💎", "⭐"]

# Web App URL
WEB_APP_URL = "https://sv42.github.io/sosal_meter_bot"

